# RotationAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarCoupler..::..RotationAngle Property
RebarCoupler Class See Also
---
Indetifies the rotation angle of the coupler around its axis.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double RotationAngle { get; set; }
```

Visual Basic
---
```text
Public Property RotationAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double RotationAngle {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | The rotation parameter cannot be set or get for Self-Orienting rebar coupler families ( rebar coupler families with FAMILY_SELF_ORIENTING parameter = 1 ). |

# See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace